app/Services/AuthService.php

SELECT *
FROM "users"
WHERE "users"."id" = 1
---
    public function me(int $userId): ?\App\Entities\User
    {
        return $this->userModel->find($userId);