app/Controllers/Api/MenuCategoryController.php

SELECT COUNT(*) AS "numrows"
FROM "menu_categories"
WHERE "status" = 'active'
AND "menu_categories"."deleted_at" IS NULL
---
    public function index(): ResponseInterface
    {
        $page      = max(1, (int) ($this->request->getGet('page') ?: 1));
        $perPage   = min(100, max(1, (int) ($this->request->getGet('per_page') ?: 20)));
        $search    = $this->request->getGet('search') ?? '';
        $status    = $this->request->getGet('status') ?? '';

        $model = new \App\Models\MenuCategoryModel();

        if ($search) {
            $model->like('name', $search);
        }
        if ($status) {
            $model->where('status', $status);
        }

        $categories = $model->orderBy('name', 'ASC')->paginate($perPage, 'default', $page);