app/Controllers/Api/MenuItemController.php

    public function index(): ResponseInterface
    {
        $page      = max(1, (int) $this->request->getGet('page') ?? 1);
        $perPage   = min(100, max(1, (int) $this->request->getGet('per_page') ?? 20));
        $search    = $this->request->getGet('search') ?? '';
        $category  = $this->request->getGet('category_id') ?? '';
        $status    = $this->request->getGet('status') ?? '';

        $model = new \App\Models\MenuItemModel();
        $builder = $model->builder();
        $builder->select('menu_items.*, menu_categories.name AS category_name')
            ->join('menu_categories', 'menu_categories.id = menu_items.category_id', 'left');

        if ($search) {
            $builder->groupStart()
                ->like('menu_items.name', $search)
                ->orLike('menu_items.description', $search)
                ->groupEnd();
        }
        if ($category) {
            $builder->where('menu_items.category_id', $category);
        }
        if ($status) {
            $builder->where('menu_items.status', $status);
        }

        $builder->orderBy('name', 'ASC');

        $items = $model->paginate($perPage, 'default', $page);
---
SELECT "menu_items".*, "menu_categories"."name" AS "category_name"
FROM "menu_items"
LEFT JOIN "menu_categories" ON "menu_categories"."id" = "menu_items"."category_id"
WHERE "menu_items"."deleted_at" IS NULL
ORDER BY "name" ASC
 LIMIT 20
SELECT COUNT(*) AS "numrows"
FROM "menu_items"
LEFT JOIN "menu_categories" ON "menu_categories"."id" = "menu_items"."category_id"
WHERE "menu_items"."deleted_at" IS NULL