app/Controllers/Api/TableController.php

SELECT *
FROM "restaurant_tables"
WHERE "restaurant_tables"."deleted_at" IS NULL
---
    public function index(): ResponseInterface
    {
        $model = new \App\Models\RestaurantTableModel();
        $tables = $model->findAll();