app/Filters/JwtAuthFilter.php

SELECT *
FROM "revoked_tokens"
WHERE "jti" = '7f289d233bcadb4195e94b94fe62ba9a'
 LIMIT 1
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $authHeader = $request->getHeaderLine('Authorization');
        if (! $authHeader || ! preg_match('/^Bearer\s+(.+)$/i', $authHeader, $matches)) {
            return $this->unauthorized('Missing or invalid Authorization header');
        }

        $token = $matches[1];
        $secret = env('JWT_SECRET') ?: getenv('JWT_SECRET');
        if (! $secret) {
            log_message('error', 'JWT_SECRET not configured in .env');
            return $this->unauthorized('Authentication misconfigured');
        }

        try {
            $decoded = JWT::decode($token, new Key($secret, 'HS256'));
            $payload = (array) $decoded;
        } catch (\Firebase\JWT\ExpiredException $e) {
            return $this->unauthorized('Token expired');
        } catch (\Firebase\JWT\SignatureInvalidException $e) {
            return $this->unauthorized('Invalid token signature');
        } catch (\Exception $e) {
            log_message('error', 'JWT decode error: ' . $e->getMessage());
            return $this->unauthorized('Invalid token');
        }

        // Check revoked_tokens blocklist
        $jti = $payload['jti'] ?? null;
        if ($jti) {
            $revokedModel = model(\App\Models\RevokedTokenModel::class);
            if ($revokedModel->where('jti', $jti)->first()) {